dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD1_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="CANFD1" HW_revision="1.0">
    <register id="CANFD1_PWREN" width="32" offset="0x6800" description="Power enable">
        <bitfield id="ENABLE" description="Enable the power" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable Power"/>
            <bitenum id="ENABLE" value="0x1" description="Enable Power"/>
        </bitfield>
    </register>
    <register id="CANFD1_RSTCTL" width="32" offset="0x6804" description="Reset Control">
        <bitfield id="RESETSTKYCLR" description="Clear the RESETSTKY bit in the STAT register" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear reset sticky bit"/>
        </bitfield>
        <bitfield id="RESETASSERT" description="Assert reset to the peripheral" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NOP" value="0x0" description="Writing 0 has no effect"/>
            <bitenum id="ASSERT" value="0x1" description="Assert reset"/>
        </bitfield>
    </register>
    <register id="CANFD1_STAT" width="32" offset="0x6814" description="Status Register">
        <bitfield id="RESETSTKY" description="This bit indicates, if the peripheral was reset, since this bit was cleared by RESETSTKYCLR in the RSTCTL register" begin="16" end="16" width="1" rwaccess="R">
            <bitenum id="NORES" value="0x0" description="The peripheral has not been reset since this bit was last cleared by RESETSTKYCLR in the RSTCTL register"/>
            <bitenum id="RESET" value="0x1" description="The peripheral was reset since the last bit clear"/>
        </bitfield>
    </register>
    <group id="CANFD1_MCAN" name="CANFD1_MCAN" instances="1" offset="0x7000" instaddr="0x100" description="">
        <register id="CANFD1_MCAN_CREL" width="32" offset="0x0" description="MCAN Core Release Register">
            <bitfield id="DAY" description="Time Stamp Day. Two digits, BCD-coded." begin="7" end="0" width="8" rwaccess="R">
            </bitfield>
            <bitfield id="MON" description="Time Stamp Month. Two digits, BCD-coded." begin="15" end="8" width="8" rwaccess="R">
            </bitfield>
            <bitfield id="YEAR" description="Time Stamp Year. One digit, BCD-coded." begin="19" end="16" width="4" rwaccess="R">
            </bitfield>
            <bitfield id="SUBSTEP" description="Sub-Step of Core Release. One digit, BCD-coded." begin="23" end="20" width="4" rwaccess="R">
            </bitfield>
            <bitfield id="STEP" description="Step of Core Release. One digit, BCD-coded." begin="27" end="24" width="4" rwaccess="R">
            </bitfield>
            <bitfield id="REL" description="Core Release. One digit, BCD-coded." begin="31" end="28" width="4" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_ENDN" width="32" offset="0x4" description="MCAN Endian Register">
        </register>
        <register id="CANFD1_MCAN_DBTP" width="32" offset="0xC" description="MCAN Data Bit Timing and Prescaler Register">
            <bitfield id="DSJW" description="Data Resynchronization Jump Width. Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="3" end="0" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="DTSEG2" description="Data Time Segment After Sample Point. Valid values are 0 to 15. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="7" end="4" width="4" rwaccess="R/W">
            </bitfield>
            <bitfield id="DTSEG1" description="Data Time Segment Before Sample Point. Valid values are 0 to 31. The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="12" end="8" width="5" rwaccess="R/W">
            </bitfield>
            <bitfield id="DBRP" description="Data Bit Rate Prescaler. The value by which the oscillator frequency is divided for generating the bit time quanta. The bit time is built up from a multiple of this quanta. Valid values for the Bit Rate Prescaler are 0 to 31. The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="20" end="16" width="5" rwaccess="R/W">
            </bitfield>
            <bitfield id="TDC" description="Transmitter Delay Compensation
  0  Transmitter Delay Compensation disabled
  1  Transmitter Delay Compensation enabled" begin="23" end="23" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TEST" width="32" offset="0x10" description="MCAN Test Register">
            <bitfield id="LBCK" description="Loop Back Mode. Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="DISABLE" value="0x0" description="Reset value, Loop Back Mode is disabled"/>
                <bitenum id="ENABLE" value="0x1" description="Loop Back Mode is enabled"/>
            </bitfield>
            <bitfield id="TX" description="Control of Transmit Pin
  00  CAN TX pin controlled by the CAN Core, updated at the end of the CAN bit time
  01  Sample Point can be monitored at CAN TX pin
  10  Dominant ('0') level at CAN TX pin
  11  Recessive ('1') at CAN TX pin
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="6" end="5" width="2" rwaccess="R/W">
            </bitfield>
            <bitfield id="RX" description="Receive Pin. Monitors the actual value of the CAN receive pin." begin="7" end="7" width="1" rwaccess="R">
                <bitenum id="DOMINANT" value="0x0" description="The CAN bus is dominant (CAN RX pin = '0')"/>
                <bitenum id="RECESSIVE" value="0x1" description="The CAN bus is recessive (CAN RX pin = '1')"/>
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_RWD" width="32" offset="0x14" description="MCAN RAM Watchdog">
            <bitfield id="WDC" description="Watchdog Configuration. Start value of the Message RAM Watchdog Counter. With the reset value of &amp;quot;00&amp;quot; the counter is disabled.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="7" end="0" width="8" rwaccess="R/W">
            </bitfield>
            <bitfield id="WDV" description="Watchdog Value. Acutal Message RAM Watchdog Counter Value.
 
The RAM Watchdog monitors the READY output of the Message RAM. A Message RAM access via the MCAN's Generic Master Interface starts the Message RAM Watchdog Counter with the value configured by the WDC field. The counter is reloaded with WDC when the Message RAM signals successful completion by activating its READY output. In case there is no response from the Message RAM until the counter has counted down to zero, the counter stops and interrupt flag MCAN_IR.WDI is set. The RAM Watchdog Counter is clocked by the host (system) clock." begin="15" end="8" width="8" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_CCCR" width="32" offset="0x18" description="MCAN CC Control Register">
            <bitfield id="INIT" description="Initialization
  0  Normal Operation
  1  Initialization is started
Note: Due to the synchronization mechanism between the two clock domains, there may be a delay until the value written to INIT can be read back. Therefore the programmer has to assure that the previous value written to INIT has been accepted by reading INIT before setting INIT to a new value." begin="0" end="0" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CCE" description="Configuration Change Enable
  0  The CPU has no write access to the protected configuration registers
  1  The CPU has write access to the protected configuration registers (while CCCR.INIT = '1')
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="1" end="1" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="ASM" description="Restricted Operation Mode. Bit ASM can only be set by SW when both CCE and INIT are set to '1'. The bit can be reset by SW at any time.
  0  Normal CAN operation
  1  Restricted Operation Mode active
 
Qualified Write 1 to Set is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="2" end="2" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="CSA" description="Clock Stop Acknowledge
  0  No clock stop acknowledged
  1  MCAN may be set in power down by stopping the Host and CAN clocks" begin="3" end="3" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="CSR" description="Clock Stop Request
  0  No clock stop is requested
  1  Clock stop requested. When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle." begin="4" end="4" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="MON" description="Bus Monitoring Mode. Bit MON can only be set by SW when both CCE and INIT are set to '1'. The bit can be reset by SW at any time.
  0  Bus Monitoring Mode is disabled
  1  Bus Monitoring Mode is enabled
 
Qualified Write 1 to Set is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="5" end="5" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="DAR" description="Disable Automatic Retransmission
  0  Automatic retransmission of messages not transmitted successfully enabled
  1  Automatic retransmission disabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="6" end="6" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="TEST" description="Test Mode Enable
  0  Normal operation, register TEST holds reset values
  1  Test Mode, write access to register TEST enabled
 
Qualified Write 1 to Set is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="7" end="7" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="FDOE" description="Flexible Datarate Operation Enable
  0  FD operation disabled
  1  FD operation enabled
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="8" end="8" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="BRSE" description="Bit Rate Switch Enable
  0  Bit rate switching for transmissions disabled
  1  Bit rate switching for transmissions enabled
Note: When CAN FD operation is disabled FDOE = '0', BRSE is not evaluated.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="9" end="9" width="1" rwaccess="R/W">
            </bitfield>
            <bitfield id="PXHD" description="Protocol Exception Handling Disable
  0  Protocol exception handling enabled
  1  Protocol exception handling disabled
Note: When protocol exception handling is disabled, the MCAN will transmit an error frame when it detects a protocol exception condition.
 
