dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD1_1.0.xml
        <register id="CANFD1_MCAN_TXBC" width="32" offset="0xC0" description="MCAN Tx Buffer Configuration">
            <bitfield id="TBSA" description="Tx Buffers Start Address. Start address of Tx Buffers section in Message RAM (32-bit word address).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="15" end="2" width="14" rwaccess="R/W">
            </bitfield>
            <bitfield id="NDTB" description="Number of Dedicated Transmit Buffers
  0      No Dedicated Tx Buffers
  1-32  Number of Dedicated Tx Buffers
  &gt;32   Values greater than 32 are interpreted as 32
 
Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check
for erroneous configurations. The Tx Buffers section in the Message RAM starts with the
dedicated Tx Buffers.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="21" end="16" width="6" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFQS" description="Transmit FIFO/Queue Size
  0      No Tx FIFO/Queue
  1-32  Number of Tx Buffers used for Tx FIFO/Queue
  &gt;32   Values greater than 32 are interpreted as 32
 
Note: Be aware that the sum of TFQS and NDTB may be not greater than 32. There is no check
for erroneous configurations. The Tx Buffers section in the Message RAM starts with the
dedicated Tx Buffers.
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="29" end="24" width="6" rwaccess="R/W">
            </bitfield>
            <bitfield id="TFQM" description="Tx FIFO/Queue Mode
  0  Tx FIFO operation
  1  Tx Queue operation
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="30" end="30" width="1" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXFQS" width="32" offset="0xC4" description="MCAN Tx FIFO / Queue Status">
            <bitfield id="TFFL" description="Tx FIFO Free Level.  Number of consecutive free Tx FIFO elements starting from TFGI, range 0 to 32. Read as zero when Tx Queue operation is configured (TXBC.TFQM = '1')." begin="5" end="0" width="6" rwaccess="R">
            </bitfield>
            <bitfield id="TFGI" description="Tx FIFO Get Index. Tx FIFO read index pointer, range 0 to 31. Read as zero when Tx Queue operation is configured (TXBC.TFQM = '1').
 
Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers. Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO." begin="12" end="8" width="5" rwaccess="R">
            </bitfield>
            <bitfield id="TFQP" description="Tx FIFO/Queue Put Index. Tx FIFO/Queue write index pointer, range 0 to 31.
 
Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers. Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO." begin="20" end="16" width="5" rwaccess="R">
            </bitfield>
            <bitfield id="TFQF" description="Tx FIFO/Queue Full
  0  Tx FIFO/Queue not full
  1  Tx FIFO/Queue full" begin="21" end="21" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXESC" width="32" offset="0xC8" description="MCAN Tx Buffer Element Size Configuration">
            <bitfield id="TBDS" description="Tx Buffer Data Field Size
  000  8 byte data field
  001  12 byte data field
  010  16 byte data field
  011  20 byte data field
  100  24 byte data field
  101  32 byte data field
  110  48 byte data field
  111  64 byte data field
 
Note: In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size TXESC.TBDS, the bytes not defined by the Tx Buffer are transmitted as &amp;quot;0xCC&amp;quot; (padding bytes).
 
Qualified Write is possible only with CCCR.CCE='1' and CCCR.INIT='1'." begin="2" end="0" width="3" rwaccess="R/W">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXBRP" width="32" offset="0xCC" description="MCAN Tx Buffer Request Pending">
            <bitfield id="TRP0" description="Transmission Request Pending 0.
 
Each Tx Buffer has its own Transmission Request Pending bit. The bits are set via register TXBAR. The bits are reset after a requested transmission has completed or has been cancelled via register TXBCR.
 
TXBRP bits are set only for those Tx Buffers configured via TXBC. After a TXBRP bit has been set, a Tx scan is started to check for the pending Tx request with the highest priority (Tx Buffer with lowest Message ID).
 
A cancellation request resets the corresponding transmission request pending bit of register TXBRP. In case a transmission has already been started when a cancellation is requested, this is done at the end of the transmission, regardless whether the transmission was successful or not. The cancellation request bits are reset directly after the corresponding TXBRP bit has been reset.
 
After a cancellation has been requested, a finished cancellation is signalled via TXBCF
- after successful transmission together with the corresponding TXBTO bit
- when the transmission has not yet been started at the point of cancellation
- when the transmission has been aborted due to lost arbitration
- when an error occurred during frame transmission
 
In DAR mode all transmissions are automatically cancelled if they are not successful. The corresponding TXBCF bit is set for all unsuccessful transmissions.
  0  No transmission request pending
  1  Transmission request pending
 
Note: TXBRP bits which are set while a Tx scan is in progress are not considered during this particular Tx scan. In case a cancellation is requested for such a Tx Buffer, this Add Request is cancelled immediately, the corresponding TXBRP bit is reset." begin="0" end="0" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP1" description="Transmission Request Pending 1. See description for bit 0." begin="1" end="1" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP2" description="Transmission Request Pending 2. See description for bit 0." begin="2" end="2" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP3" description="Transmission Request Pending 3. See description for bit 0." begin="3" end="3" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP4" description="Transmission Request Pending 4. See description for bit 0." begin="4" end="4" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP5" description="Transmission Request Pending 5. See description for bit 0." begin="5" end="5" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP6" description="Transmission Request Pending 6. See description for bit 0." begin="6" end="6" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP7" description="Transmission Request Pending 7. See description for bit 0." begin="7" end="7" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP8" description="Transmission Request Pending 8. See description for bit 0." begin="8" end="8" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP9" description="Transmission Request Pending 9. See description for bit 0." begin="9" end="9" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP10" description="Transmission Request Pending 10. See description for bit 0." begin="10" end="10" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP11" description="Transmission Request Pending 11. See description for bit 0." begin="11" end="11" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP12" description="Transmission Request Pending 12. See description for bit 0." begin="12" end="12" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP13" description="Transmission Request Pending 13. See description for bit 0." begin="13" end="13" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP14" description="Transmission Request Pending 14. See description for bit 0." begin="14" end="14" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP15" description="Transmission Request Pending 15. See description for bit 0." begin="15" end="15" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP16" description="Transmission Request Pending 16. See description for bit 0." begin="16" end="16" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP17" description="Transmission Request Pending 17. See description for bit 0." begin="17" end="17" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP18" description="Transmission Request Pending 18. See description for bit 0." begin="18" end="18" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP19" description="Transmission Request Pending 19. See description for bit 0." begin="19" end="19" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP20" description="Transmission Request Pending 20. See description for bit 0." begin="20" end="20" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP21" description="Transmission Request Pending 21. See description for bit 0." begin="21" end="21" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP22" description="Transmission Request Pending 22. See description for bit 0." begin="22" end="22" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP23" description="Transmission Request Pending 23. See description for bit 0." begin="23" end="23" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP24" description="Transmission Request Pending 24. See description for bit 0." begin="24" end="24" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP25" description="Transmission Request Pending 25. See description for bit 0." begin="25" end="25" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP26" description="Transmission Request Pending 26. See description for bit 0." begin="26" end="26" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP27" description="Transmission Request Pending 27. See description for bit 0." begin="27" end="27" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP28" description="Transmission Request Pending 28. See description for bit 0." begin="28" end="28" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP29" description="Transmission Request Pending 29. See description for bit 0." begin="29" end="29" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP30" description="Transmission Request Pending 30. See description for bit 0." begin="30" end="30" width="1" rwaccess="R">
            </bitfield>
            <bitfield id="TRP31" description="Transmission Request Pending 31. See description for bit 0." begin="31" end="31" width="1" rwaccess="R">
            </bitfield>
        </register>
        <register id="CANFD1_MCAN_TXBAR" width="32" offset="0xD0" description="MCAN Tx Buffer Add Request">
            <bitfield id="AR0" description="Add Request 0.
 
