dogusyuksel/ti_cc2640r2f_sdk/ccs1281/ccs/ccs_base/common/targetdb/Modules/msp/mspm0gx51x/CANFD1_1.0.xml
                <register id="CANFD1_MIS" width="32" offset="0x18" description="Masked interrupt status">
                    <bitfield id="INTL0" description="Masked MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="INTL1" description="Masked MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="SEC" description="Masked Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="DED" description="Masked Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="Masked External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Masked Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="CLR" value="0x0" description="Interrupt did not occur"/>
                        <bitenum id="SET" value="0x1" description="Interrupt occured"/>
                    </bitfield>
                </register>
                <register id="CANFD1_ISET" width="32" offset="0x20" description="Interrupt set">
                    <bitfield id="INTL0" description="Set MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="INTL1" description="Set MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="SEC" description="Set Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="DED" description="Set Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="Set External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Set Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="SET" value="0x1" description="Set Interrupt"/>
                    </bitfield>
                </register>
                <register id="CANFD1_ICLR" width="32" offset="0x28" description="Interrupt clear">
                    <bitfield id="INTL0" description="Clear MCAN Interrupt Line 0." begin="0" end="0" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="INTL1" description="Clear MCAN Interrupt Line 1." begin="1" end="1" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="SEC" description="Clear Message RAM SEC interrupt." begin="2" end="2" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="DED" description="Clear Message RAM DED interrupt." begin="3" end="3" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="EXT_TS_CNTR_OVFL" description="Clear External Timestamp Counter Overflow interrupt." begin="4" end="4" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                    <bitfield id="WAKEUP" description="Clear Clock Stop Wake Up interrupt." begin="5" end="5" width="1" rwaccess="R/W">
                        <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                        <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
                    </bitfield>
                </register>
